docs/sequence_diagram/revisi/melihat_pengumuman.puml
@startuml
skinparam SwimlaneTitleFontSize 14
skinparam SwimlaneBorderThickness 1
skinparam ActivityBackgroundColor #FEFECE
skinparam ActivityBorderColor #A80036
skinparam ActivityFontSize 12
skinparam ArrowColor #A80036
skinparam Shadowing false

actor "Calon Siswa / Pengunjung" as User
boundary "Halaman Pengumuman" as View
boundary "Halaman Detail Pengumuman" as ViewDetail
control "PengumumanController" as Ctrl
entity "Pengumuman" as Model

User -> View : Mengakses menu pengumuman
activate View

View -> Ctrl : index(request)
activate Ctrl

alt Ada Pencarian
    Ctrl -> Model : search(keyword)
else Default
    Ctrl -> Model : getLatest()
end
activate Model
Model --> Ctrl : listPengumuman
deactivate Model

Ctrl -> View : renderView('public.pengumuman', listPengumuman)
deactivate Ctrl

View --> User : Menampilkan daftar pengumuman

opt Pilih Pengumuman
    User -> View : Klik judul pengumuman
    View -> Ctrl : show(slug)
    activate Ctrl
    
    Ctrl -> Model : findBySlug(slug)
    activate Model
    Model --> Ctrl : dataPengumuman
    deactivate Model
    
    Ctrl -> ViewDetail : renderView('public.pengumuman-detail', dataPengumuman)
    deactivate Ctrl
    activate ViewDetail
    
    ViewDetail --> User : Menampilkan detail isi pengumuman
    deactivate ViewDetail
end

@enduml
